[
  {
    "id": "1",
    "title": "Al-Qur'an",
    "data": [
      {
        "id": "1",
        "tag": [ "khatam", "alquran", "al quran", "al-qur'an" ],
        "title": "Doa Khatam Al-Qur'an",
        "arabic": "اللهم ارْحَمْنِي بِالْقُرْآنِ وَاجْعَلْهُ لِي إِمَامًا وَنُورًا وَهُدًى وَرَحْمَةً، اللهم ذَكِّرْنِي مِنْهُ مَا نُسِّيتُ وَعَلِّمْنِي مِنْهُ مَا جَهِلْتُ وَارْزُقْنِي تِلَاوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَا رَبَّ الْعَالَمِينَ",
        "arabiclatin": "Allhummarhamni bilquran. Waj'alhu lii imaman wa nuran wa hudan wa rohmah. Allhumma dzakkirni minhu maa nasiitu wa 'allimnii minhu maa jahiltu warzuqnii tilawatahu aana-allaili wa'atrofannahaar waj'alhu li hujatan ya rabbal 'alamin.",
        "translatedid": "Ya Allah, rahmatilah aku dengan Al-Quran. Jadikanlah ia sebagai pemimpin, cahaya, petunjuk, dan rahmat bagiku. Ya Allah, ingatkanlah aku atas apa yang terlupakan darinya. Ajarilah aku atas apa yang belum tahu darinya. Berikanlah aku kemampuan membacanya sepanjang malam dan ujung siang. Jadikanlah ia sebagai pembelaku, wahai tuhan semesta alam.",
        "faedah": "",
        "note": "",
        "narrator": ""
      }
    ]
  },
  {
    "id": "2",
    "title": "Tidur",
    "data": [
      {
        "id": "1",
        "tag": [ "rumah", "kamar", "setiap hari" ],
        "title": "Do'a Bangun Tidur (1)",
        "arabic": "الْحَمْدُ لِلّٰهِ الّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
        "arabiclatin": "Alhamdulillahilladzi ahyaana ba'da maa amaatanaa wa ilaihinnusyuur",
        "translatedid": "Segala puji bagi Allah Yang membangunkan kami setelah ditidurkan-Nya dan kepada-Nya kami dibangkitkan",
        "narrator": "HR. Bukhari dalam Fathul Bari: 11/113 dan Muslim: 4/2083"
      },
      {
        "id": "2",
        "tag": [ "rumah", "kamar", "setiap hari" ],
        "title": "Do'a Bangun Tidur (2)",
        "arabic": "لَا إِلَهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. سُبْحَانَ اللّٰهِ وَالْحَمْدُ لِلّٰهِ وَلَا إِلَهَ إِلَّا اللّٰهُ وَاللّٰهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ الْعَلِيِّ الْعَظِيْمِرَبِّ اغْفِرْليِ",
        "arabiclatin": "Laa ilaha illallohu wahdahuu laa syariikalahu. Lahulmulku wa lahulhamdu wahuwa 'alaa kulli syai'in qadiir. Subhaanallahi walhamdulillahi walaa ilaha illallohu wallohu akbaru. Wa laahaula wa laaquwata illabillahil 'aliyil 'adziimirrobbighfirlii",
        "translatedid": "Tiada Tuhan selain Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah Yang Maha Kuasa atas segala sesuatu. Maha Suci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Maha Besar. Tiada upaya dan kekuatan kecuali dengan pertolongan Allah Yang Maha Tinggi dan Maha Agung. Ya Tuhanku, ampunilah dosaku",
        "narrator": "Siapa yang membacanya akan diampuni, jika dia berdo'a akan dikabulkan, dan jika dia bangun untuk berwudhu' lalu shalat, maka shalatnya diterima, Imam Bukhari dalam Fathul Bari: 3/39 dan lainnya. Lafadz diatas dari Ibnu Majah, lihat Shahih Ibnu Majah: 2/335"
      },
      {
        "id": "3",
        "tag": [ "rumah", "kamar", "setiap hari" ],
        "title": "Do'a Bangun Tidur (3)",
        "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِي عَافَانِي فِي جَسَدِي وَرَدَّ عَلَيَّ رُوْحِيْ وَأَذِنَ لِيْ بِذِكْرِهِ",
        "arabiclatin": "Alhamdulillahilladzi 'aafaani fii jasadi warodda ilaiya ruuhi wa adzinaa lii bidzikrihi",
        "translatedid": "Segala puji bagi Allah Yang telah memberikan kesehatan kepada-ku, mengembalikan ruh dan merestuiku untuk berdzikir kepada-Nya",
        "narrator": "H.R: Tirmidzi: 5/473, lihat Shahih Tirmidzi: 3/144"
      },
      {
        "id": "4",
        "tag": [ "rumah", "kamar", "setiap hari", "quran" ],
        "title": "Do'a Bangun Tidur (4)",
        "arabic": "اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّيْلِ وَالنَّهَارِ لَاٰيٰتٍ لِّاُولِى الْاَلْبَابِ . الَّذِيْنَ يَذْكُرُوْنَ اللّٰهَ قِيَامًا وَّقُعُوْدًا وَّعَلٰى جُنُوْبِهِمْ وَيَتَفَكَّرُوْنَ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِۚ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًاۚ سُبْحٰنَكَ فَقِنَا عَذَابَ النَّارِ . رَبَّنَآ اِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ اَخْزَيْتَهُ ۗ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ . رَبَّنَآ اِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِيْ لِلْاِيْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّا ۖرَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِ . رَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۗ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ . فَاسْتَجَابَ لَهُمْ رَبُّهُمْ اَنِّيْ لَآ اُضِيْعُ عَمَلَ عَامِلٍ مِّنْكُمْ مِّنْ ذَكَرٍ اَوْ اُنْثٰى ۚ بَعْضُكُمْ مِّنْۢ بَعْضٍ ۚ فَالَّذِيْنَ هَاجَرُوْا وَاُخْرِجُوْا مِنْ دِيَارِهِمْ وَاُوْذُوْا فِيْ سَبِيْلِيْ وَقٰتَلُوْا وَقُتِلُوْا لَاُكَفِّرَنَّ عَنْهُمْ سَيِّاٰتِهِمْ وَلَاُدْخِلَنَّهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۚ ثَوَابًا مِّنْ عِنْدِ اللّٰهِ ۗ وَاللّٰهُ عِنْدَهُ حُسْنُ الثَّوَابِ . لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا فِى الْبِلَادِۗ . مَتَاعٌ قَلِيْلٌ ۗ ثُمَّ مَأْوٰىهُمْ جَهَنَّمُ ۗوَبِئْسَ الْمِهَادُ . لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا نُزُلًا مِّنْ عِنْدِ اللّٰهِ ۗ وَمَا عِنْدَ اللّٰهِ خَيْرٌ لِّلْاَبْرَارِ . وَاِنَّ مِنْ اَهْلِ الْكِتٰبِ لَمَنْ يُّؤْمِنُ بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْكُمْ وَمَآ اُنْزِلَ اِلَيْهِمْ خٰشِعِيْنَ لِلّٰهِ ۙ لَا يَشْتَرُوْنَ بِاٰيٰتِ اللّٰهِ ثَمَنًا قَلِيْلًا ۗ اُولٰۤىِٕكَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ ۗ اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ . يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرُوْا وَرَابِطُوْاۗ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ",
        "arabiclatin": "inna fii kholqissamaawaati wal ardhi wakhtilaafillaili wannahaari la'ayatilliulil albaab. alladziina yadzkuruunalloha qiyaaman waqu'uudan wa'ala junubihim wayatafakkaruuna fii kholqissamaawi wal ardhi robbana maa kholaqta hadza batila subhanaka faqinaa adzaabannaar. robbana innaka man tudkhilinnaro faqod akhzaitahu wama liddzolimiina min anshor. robbana innanaa sami'na munaadiyan yunaadii lil'iimani an aminu birobbikum fa'amanna. Robbana faghfirlana dzunubana wakaffir'anna sayyi'atina watawaffana ma'al ab'roor. Robbana wa atina ma wa'attana 'ala rusulika wa laa tuhzina yaumalqiyamah, innaka laa tukhliful mi'aad. Fastajaaba lahum robbuhum anni laa udii'u 'amala 'amilimminkum min dzakarin au'untsa, ba'dukum mimba'dii, falladziina haajaruu wa'ukhriju mindiyaarihim wa'uudzu fii sabiilii waqootaluu waqutiluu laukaffironna anhum sayyi'aatihim walaud'khilannahum jannaatinn taj'riimin tahtihal'anhaaru, tsawaabamin 'indillahi, wallohu 'indahu husnutssawaab. Laa yaghurronnaka taqollubulldziina kafaruu filbilaad. mataa'un qolill, tsumma ma'waahum jahannamu wabi'sal mihaad. laakinilladzina taqou robbuhum jannaatun taj'riimin tahtihal'anhaaru khoolidiina fiihaa nuzulammin 'indillah, wamaa 'indallohi khoirun lilab'roor. wainna min ahlilkitaabi laman yu'minubilllahi wamaa unzila ilaikum wamaa unzila ilaihim khoosyi'iina lillahi laa yasy'taruuna bi'aayaatillahi tsamanan qoliila, ulaaika lahum aj'ruhum 'inda robbihim, innalloha sarii'ul hisaab. yaa ayyuhalladziina aamanush'biruu washoobiruu waroobithuu, wattaqulloha la'allakum tuflihuun",
        "translatedid": "Sesungguhnya dalam penciptaan langit dan bumi, dan pergantian malam dan siang terdapat tanda-tanda (kebesaran Allah) bagi orang yang berakal. (yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk atau dalam keadaan berbaring, dan mereka memikirkan tentang penciptaan langit dan bumi (seraya berkata), “Ya Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia; Mahasuci Engkau, lindungilah kami dari azab neraka. Ya Tuhan kami, sesungguhnya orang yang Engkau masukkan ke dalam neraka, maka sungguh, Engkau telah menghinakannya, dan tidak ada seorang penolong pun bagi orang yang zalim. Ya Tuhan kami, sesungguhnya kami mendengar orang yang menyeru kepada iman, (yaitu), “Berimanlah kamu kepada Tuhanmu,” maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, dan matikanlah kami beserta orang-orang yang berbakti. Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui rasul-rasul-Mu. Dan janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak pernah mengingkari janji. Maka Tuhan mereka memperkenankan permohonannya (dengan berfirman), “Sesungguhnya Aku tidak menyia-nyiakan amal orang yang beramal di antara kamu, baik laki-laki maupun perempuan, (karena) sebagian kamu adalah (keturunan) dari sebagian yang lain. Maka orang yang berhijrah, yang diusir dari kampung halamannya, yang disakiti pada jalan-Ku, yang berperang dan yang terbunuh, pasti akan Aku hapus kesalahan mereka dan pasti Aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungai-sungai, sebagai pahala dari Allah. Dan di sisi Allah ada pahala yang baik. Jangan sekali-kali kamu teperdaya oleh kegiatan orang-orang kafir (yang bergerak) di seluruh negeri. Itu hanyalah kesenangan sementara, kemudian tempat kembali mereka ialah neraka Jahanam. (Jahanam) itu seburuk-buruk tempat tinggal. Tetapi orang-orang yang bertakwa kepada Tuhannya, mereka akan mendapat surga-surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya sebagai karunia dari Allah. Dan apa yang di sisi Allah lebih baik bagi orang-orang yang berbakti. Dan sesungguhnya di antara Ahli Kitab ada yang beriman kepada Allah, dan kepada apa yang diturunkan kepada kamu, dan yang diturunkan kepada mereka, karena mereka berendah hati kepada Allah, dan mereka tidak memperjualbelikan ayat-ayat Allah dengan harga murah. Mereka memperoleh pahala di sisi Tuhannya. Sungguh, Allah sangat cepat perhitungan-Nya. Wahai orang-orang yang beriman! Bersabarlah kamu dan kuatkanlah kesabaranmu dan tetaplah bersiap-siaga (di perbatasan negerimu) dan bertakwalah kepada Allah agar kamu beruntung",
        "narrator": "Ayat dari surat Ali Imran: 190-200, shahih Bukhari dalam Fathul Bari 8/237, Muslim 1/530"
      }
    ]
  },
  {
    "id": "3",
    "title": "Pakaian",
    "data": [
      {
        "id": "1",
        "tag": [ "rumah", "pakaian", "setiap hari" ],
        "title": "Do'a Mengenakan Pakaian",
        "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِي كَسَانِيْ هَذَا (الثَّوْبَ) وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْلٍ مِنِّيْ وَلَا قُوَّةٍ",
        "arabiclatin": "Alhamdulillahilladzi kasaanii hadzaatssauba warozaqoniihi min ghairi khaulin minnii walaa quwwatin",
        "translatedid": "Segala puji bagi Allah Yang telah memberikan pakaian ini kepadaku sebagai rezeki dari-pada-Nya tanpa daya dan kekuatan dari-ku",
        "narrator": "Hadits diriwayatkan oleh semua penyusun kitab sunan, kecuali Nasa'i, lihat: Irwa'ul ghalil"
      },
      {
        "id": "2",
        "tag": [ "rumah", "pakaian" ],
        "title": "Do'a Mengenakan Pakaian Baru",
        "arabic": "اللهم لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنعَ لَهُ",
        "arabiclatin": "Allohumma lakalhamdu anta kasautaniihi, as'aluka min khoirihi wa khoiri maa shun'a lahu, wa a'uudzubika min syarrihi wasyarrima shun'a lahu",
        "translatedid": "Ya Allah hanya miliki-Mu segala puji, Engkaulah yang memberi pakaian ini kepadaku. Aku mohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang ia diciptakan karenanya",
        "narrator": "HT. Abu Dawud, At-Tirmidzi, Al-Baghawi dan lihat Mukhtashar Syamaailit Tirmidzi, oleh Al-Albani, hal: 47"
      },
      {
        "id": "3",
        "tag": [ "rumah", "pakaian" ],
        "title": "Mendoakan Orang yang Mengenakan Pakaian Baru (1)",
        "arabic": "تُبْلِي وَيُخْلِفُ اللّٰهُ تَعَلَى",
        "arabiclatin": "Tub'li wayukhlifullou ta'ala",
        "translatedid": "Kenakanlah sampai lusuh, semoga Allah ta'ala memberikan gantinya kepadamu",
        "narrator": "HR. Abu Dawud 4.41 dan lihat pula Shahih Abi Dawud, 2/760"
      },
      {
        "id": "4",
        "tag": [ "rumah", "pakaian" ],
        "title": "Mendoakan Orang yang Mengenakan Pakaian Baru (2)",
        "arabic": "اِلْبِسْ جَدِيْدًا، وَعِشْ حَمِيْدًا، وَمُتْ شَهِيْدًا",
        "arabiclatin": "ilbis jadiidan wa'isy hamiidan wamut syahiidan",
        "translatedid": "Berpakaianlah yang baru, hiduplah dengan terpuji dan matilah dalam keadaan syahid",
        "narrator": "HR. Ibnu Majah: 2/1178, Al-Baghawi: 12/41 dan lihat Shahih Ibnu Majah: 2/275"
      },
      {
        "id": "5",
        "tag": [ "rumah", "pakaian" ],
        "title": "Doa Meletakkan Pakaian",
        "arabic": "بِسْمِ اللّٰهِ",
        "arabiclatin": "Bismillah",
        "translatedid": "Dengan nama Allah (aku meletakkan baju)",
        "narrator": "HR. At-Tirmidzi: 2/505 dan Imam yang lain. Lihat Irwa'ul Ghalil, 49 dan Shahihul Jami': 3/230"
      }
    ]
  },
  {
    "id": "4",
    "title": "Toilet",
    "data": [
      {
        "id": "1",
        "tag": [ "rumah", "toilet", "wc" ],
        "title": "Doa Masuk Toilet",
        "arabic": "(بِسْمِ اللّٰهِ) اللهم إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبائِثْ",
        "arabiclatin": "(Bismillahi) Allohumma inni a'udzubika minal khubutsi wal khobaits",
        "translatedid": "Dengan nama Allah. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan",
        "narrator": "Hr. Al-Bukhari: 1/45 dan Muslim: 1/283. Sedang tambahan 'bismillah' pada permulaan hadits, menurut riwayat Said bin Manshur. Lihat Fathul Baari: 1/244"
      },
      {
        "id": "2",
        "tag": [ "rumah", "toilet", "wc" ],
        "title": "Doa Keluar dari Toilet",
        "arabic": "غُفْرَانَكَ",
        "arabiclatin": "Ghufronaka",
        "translatedid": "Aku minta ampun kepada-Mu",
        "narrator": "Hadist diriwayatkan oleh para penulis kutubus sunan kecuali Imam Nasa'i, beliau meriwayatkan di kitab amalul yaumi wa lailah, lihat juga takhrij zadil maad 2/122"
      }
    ]
  },
  {
    "id": "5",
    "title": "Wudhu",
    "data": [
      {
        "id": "1",
        "tag": [ "rumah", "wudhu", "bismillah", "bismilah", "basmalah" ],
        "title": "Bacaan Sebelum Wudhu ",
        "arabic": "بِسْمِ اللّٰهِ",
        "arabiclatin": "Bismillah",
        "translatedid": "Dengan nama Allah (aku berwudhu)",
        "narrator": "HR. Abu Dawud, Ibnu Majah dan Ahmad. Lihat Irwa'ul Ghalil 1/122"
      },
      {
        "id": "2",
        "tag": [ "rumah", "wudhu" ],
        "title": "Bacaan Setelah Wudhu (1)",
        "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُهَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
        "arabiclatin": "Asyhadu allaailaha illalloh wahdahulaa syariikalah wa asyhadu anna muhammadan abduhu warosuluhu",
        "translatedid": "Aku bersaksi bahwa tiada Tuhan yang haq kecuali Allah, Yang Maha Esa dan tiada sekutu bagi-Nya. Aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya",
        "narrator": "HR. Muslim: 1/209"
      },
      {
        "id": "3",
        "tag": [ "rumah", "wudhu" ],
        "title": "Bacaan Setelah Wudhu (2)",
        "arabic": "اللهم اجْعَلْنِيْ مِنَ التَّوَّابِيْنَ وَاجْعَلْنِيْ مِنَ الُمُتَطَهِّرِيْنَ",
        "arabiclatin": "Allohummaj'alni minattauwabina waj'alni minal mutatohhirin",
        "translatedid": "Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang (yang senang) bersuci",
        "narrator": "At-Tirmidzi: 1/78, dan lihat Shahih At-Tirmidzi: 1/18"
      },
      {
        "id": "4",
        "tag": [ "rumah", "wudhu" ],
        "title": "Bacaan Setelah Wudhu (3)",
        "arabic": "سُبْحَانَكَ اللهم وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
        "arabiclatin": "Subhanakallohumma wabihamdika asyhadu anlaailaha illa anta astaghfiruka wa'atubu ilaik",
        "translatedid": "Maha Suci Engkau, ya Allah, aku memuji kepada-Mu. Aku bersaksi, bahwa tiada Tuhan yang haq disembah selain Engkau, aku minta ampun dan bertaubat kepada-Mu",
        "narrator": "HR. An-Nasa'i dalam 'Amalul Yaumi wal Lailah,  halaman: 173 dan lihat Irwa'ul Ghalil: 1/135 dan 2/94"
      }
    ]
  },
  {
    "id": "6",
    "title": "Rumah",
    "data": [
      {
        "id": "1",
        "tag": [ "rumah", "bismillah", "bismilah", "basmalah" ],
        "title": "Do'a Keluar Rumah (1)",
        "arabic": "بِسْمِ اللَّهِ، تَوَكَّلتُ عَلَى اللّٰهِ،  وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ",
        "arabiclatin": "Bismillahi tawakkaltu 'alalloh, wala haula wala quwata illa billah",
        "translatedid": "Dengan nama Allah (aku keluar). Aku bertawakkal kepada-Nya, dan tiada daya dan kekuatan kecuali karena pertolongan Allah",
        "narrator": "HR. Abu Dawud: 4/325. At-Tirmidzi: 5/490, dan lihat Shahih At-Tirmidzi: 3/151"
      },
      {
        "id": "2",
        "tag": [ "rumah" ],
        "title": "Do'a Keluar Rumah (2)",
        "arabic": "اللهم إِنِّيْ أَعُوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُزِلَّ، أَوْ أُزَلَّ، أَوْ أُظْلَمُ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
        "arabiclatin": "Allohumma inni a'udzubika an adilla au'adholla, au azilla, au azalla, au adzlima, au adzlama, au aj'hala, au yuj'hala alaiya",
        "translatedid": "Ya Allah, sesungguhnya aku berlindung kepada-Mu, jangan sampai aku sesat atau disesatkan (setan atau orang yang berwatak setan), atau berbuat kesalahan atau disalahi, menganiaya atau dianiaya (orang), dan berbuat bodoh atau dibodohi",
        "narrator": "HR. Seluruh penyusun kitab Sunan, dan lihath Shahih At-Tirmidzi: 3/152 dan Shahih Ibnu Majah: 2/336"
      },
      {
        "id": "3",
        "tag": [ "rumah", "bismillah", "bismilah", "basmalah" ],
        "title": "Do'a Masuk Rumah",
        "arabic": "بِسْمِ اللّٰهِ وَلَجْنَا، وَبِسْمِ اللّٰهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
        "arabiclatin": "Bismillahi walaj'na wabismillahi khoroj'na wa'ala robbina yatawakkaluna",
        "translatedid": "'Dengan nama Allah, kami masuk (ke rumah), dengan nama Allah, kami keluar (darinya) dan kepada Tuhan kami, kami bertawakkal'. Kemudian mengucapkan salam kepada keluarganya",
        "narrator": "HR. Abu Dawud: 4/325, dan Al-'Allamah Ibnu Baaz berpendapat, isnad hadits tersebut hasan dalam Tuhfatul Akhyar, no. 28. Dalam Kitab Shahih: 'Apabila seseorang masuk rumahnya lalu berdzikir kepada Allah ketika masuk rumah dan makan, syaitan berkata (kepada teman-temannya), \"Tiada tempat tinggal dan makanan bagi kalian (malam ini)\"'. Muslim, no. 2018"
      }
    ]
  },
  {
    "id": "7",
    "title": "Kutipan Doa dari Al-Qur'an",
    "data": [
      {
        "id": 1,
        "tag": [ "kebaikan", "dunia", "akhirat", "Al-Qur'an" ],
        "title": "Do'a Mohon Kebaikan Demi Akhirat",
        "arabic": "رَبَّنَآ اٰتِنَا فِى الدُّنْيَا حَسَنَةً وَّفِى الْاٰخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ",
        "arabiclatin": "Rabbanā ātinā fid-dun-yā ḥasanataw wa fil-ākhirati ḥasanataw wa qinā 'ażāban-nār",
        "translatedid": "“Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari azab neraka.”",
        "narrator": "Q.S Al-Baqarah: 201"
      },
      {
        "id": 2,
        "tag": [ "tabah", "menghadapi", "lawan", "kafir", "Al-Qur'an" ],
        "title": "Do'a Tabah Menghadapi Lawan",
        "arabic": "رَبَّنَآ اَفْرِغْ عَلَيْنَا صَبْرًا وَّثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْن",
        "arabiclatin": "rabbanā afrig 'alainā ṣabraw wa ṡabbit aqdāmanā wanṣurnā 'alal-qaumil-kāfirīn",
        "translatedid": "“Ya Tuhan kami, limpahkanlah kesabaran kepada kami, kukuhkanlah langkah kami dan tolonglah kami menghadapi orang-orang kafir.”",
        "narrator": "Q.S Al-Baqarah: 250"
      },
      {
        "id": 3,
        "tag": [ "teguh", "keteguhan", "iman", "Al-Qur'an" ],
        "title": "Do'a Diberi Keteguhan Iman",
        "arabic": "رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً ۚاِنَّكَ اَنْتَ الْوَهَّابُ",
        "arabiclatin": "rabbanā lā tuzig qulụbanā ba'da iż hadaitanā wa hab lanā mil ladungka raḥmah, innaka antal-wahhāb",
        "translatedid": "“Ya Tuhan kami, janganlah Engkau condongkan hati kami kepada kesesatan setelah Engkau berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi-Mu, sesungguhnya Engkau Maha Pemberi.”",
        "narrator": "Q.S Ali 'Imran: 8"
      },
      {
        "id": 4,
        "tag": [ "kuat", "kekuatan", "iman", "Al-Qur'an" ],
        "title": "Do'a Kekuatan Iman",
        "arabic": "رَبَّنَآ اِنَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَقِنَا عَذَابَ النَّارِۚ",
        "arabiclatin": "Rabbanā innanā āmannā fagfir lanā żunụbanā wa qinā 'ażāban-nār",
        "translatedid": "“Ya Tuhan kami, kami benar-benar beriman, maka ampunilah dosa-dosa kami dan lindungilah kami dari azab neraka.”",
        "narrator": "Q.S Ali 'Imran: 16"
      },
      {
        "id": 5,
        "tag": [ "husnul", "khatimah", "Al-Qur'an" ],
        "title": "Do'a Husnul Khatimah",
        "arabic": "رَبَّنَآ اِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِيْ لِلْاِيْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّا ۖرَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِۚ  (١٩٣)  رَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۗ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
        "arabiclatin": "Rabbanā innanā sami'nā munādiyay yunādī lil-īmāni an āminụ birabbikum fa āmannā rabbanā fagfir lanā żunụbanā wa kaffir 'annā sayyi`ātinā wa tawaffanā ma'al-abrār. Rabbanā wa ātinā mā wa'attanā 'alā rusulika wa lā tukhzinā yaumal-qiyāmah, innaka lā tukhliful-mī'ād",
        "translatedid": "Ya Tuhan kami, sesungguhnya kami mendengar orang yang menyeru kepada iman, (yaitu), “Berimanlah kamu kepada Tuhanmu,” maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, dan matikanlah kami beserta orang-orang yang berbakti. Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui rasul-rasul-Mu. Dan janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak pernah mengingkari janji.”",
        "narrator": "Q.S Ali 'Imran: 193-194"
      },
      {
        "id": 6,
        "tag": [ "penyesalan", "istighfar", "nabi", "adam", "Al-Qur'an" ],
        "title": "Do'a Penyesalan / Istighfar Nabi Adam",
        "arabic": "رَبَّنَا ظَلَمْنَآ اَنْفُسَنَا وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
        "arabiclatin": "Rabbanā ẓalamnā anfusana wa il lam tagfir lanā wa tar-ḥamnā lanakụnanna minal-khāsirīn",
        "translatedid": "“Ya Tuhan kami, kami telah menzalimi diri kami sendiri. Jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya kami termasuk orang-orang yang rugi.”",
        "narrator": "Q.S Al-A'raf: 23"
      },
      {
        "id": 7,
        "tag": [ "mohon", "perlindungan", "api", "neraka", "Al-Qur'an" ],
        "title": "Do'a Mohon Perlindungan dari Api Neraka",
        "arabic": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِيْنَ ࣖ",
        "arabiclatin": "Rabbanā lā taj'alnā ma'al-qaumiẓ-ẓālimīn",
        "translatedid": "“Ya Tuhan kami, janganlah Engkau tempatkan kami bersama-sama orang-orang zalim itu.”",
        "narrator": "Q.S Al-A'raf: 47"
      },
      {
        "id": 8,
        "tag": [ "mohon", "keadilan", "adil", "Al-Qur'an" ],
        "title": "Do'a Mohon Keadilan",
        "arabic": "رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَاَنْتَ خَيْرُ الْفَاتِحِيْنَ",
        "arabiclatin": "Rabbanaftaḥ bainanā wa baina qauminā bil-ḥaqqi wa anta khairul-fātiḥīn",
        "translatedid": "Ya Tuhan kami, berilah keputusan antara kami dan kaum kami dengan hak (adil). Engkaulah pemberi keputusan terbaik.”",
        "narrator": "Q.S Al-A'raf: 89"
      },
      {
        "id": 9,
        "tag": [ "mohon", "keselamatan", "selamat", "Al-Qur'an" ],
        "title": "Do'a Mohon Keselamatan",
        "arabic": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِيْنَ (٨٥) وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِيْنَ",
        "arabiclatin": "Rabbanā lā taj'alnā fitnatal lil-qaumiẓ-ẓālimīn. Wa najjinā biraḥmatika minal-qaumil-kāfirīn",
        "translatedid": "Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi kaum yang zalim, dan selamatkanlah kami dengan rahmat-Mu dari orang-orang kafir.”",
        "narrator": "Q.S Hud: 85-86"
      },
      {
        "id": 10,
        "tag": [ "mohon", "perlindungan", "lindung", "Al-Qur'an" ],
        "title": "Do'a Mohon Perlindungan",
        "arabic": "رَبِّ اِنِّيْٓ اَعُوْذُ بِكَ اَنْ اَسْـَٔلَكَ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ ۗوَاِلَّا تَغْفِرْ لِيْ وَتَرْحَمْنِيْٓ اَكُنْ مِّنَ الْخٰسِرِيْنَ",
        "arabiclatin": "Rabbi innī a'ụżu bika an as`alaka mā laisa lī bihī 'ilm, wa illā tagfir lī wa tar-ḥamnī akum minal-khāsirīn",
        "translatedid": "“Ya Tuhanku, sesungguhnya aku berlindung kepada-Mu untuk memohon kepada-Mu sesuatu yang aku tidak mengetahui (hakikatnya). Kalau Engkau tidak mengampuniku, dan (tidak) menaruh belas kasihan kepadaku, niscaya aku termasuk orang yang rugi.”",
        "narrator": "Q.S Hud: 47"
      }
    ]
  }
]